docs/src/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-02 Tue 10:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Henrik Kjerringvåg" />
<link rel="stylesheet" href="css/docs.css"></head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0d0a3e">Git</a>
<ul>
<li><a href="#org07c6d8c">Custom functionality</a>
<ul>
<li><a href="#org5ded1d0">Words diff</a></li>
<li><a href="#org36f94ed">Who am I</a></li>
</ul>
</li>
<li><a href="#orga623986">Core</a></li>
<li><a href="#orgb5ae175">Alias</a></li>
<li><a href="#orgeb5132d">Color</a></li>
<li><a href="#org5157c00">Credential</a></li>
<li><a href="#orga144f4e">Status</a></li>
<li><a href="#org4a21749">Diff</a></li>
<li><a href="#org3080f5e">Push</a></li>
<li><a href="#orgcf81e62">Pull</a></li>
<li><a href="#org8991ef4">Commit</a></li>
<li><a href="#org3bfde0b">Fetch</a></li>
<li><a href="#org966ceb8">GC</a></li>
<li><a href="#orga68ece5">Branch</a></li>
<li><a href="#orge5004e7">Grep</a></li>
<li><a href="#orga88a921">Filters</a></li>
<li><a href="#org28d36b4">Magit</a></li>
<li><a href="#org714fa25">Apply</a></li>
<li><a href="#orgc3dcc3a">Merge</a></li>
<li><a href="#org1fe9403">Transfer</a></li>
<li><a href="#org9620b92">Include</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc0d0a3e" class="outline-2">
<h2 id="orgc0d0a3e">Git</h2>
<div class="outline-text-2" id="text-orgc0d0a3e">
<p>
These are global git-configurations that people most often set using
<code>git config --global</code>. Since those would be overwritten upon tangling
this document, I advise against it. Use <code>git config --(system|local)</code> or
manually add to <code>~/.gitconfig.local</code> instead.
</p>
</div>

<div id="outline-container-org07c6d8c" class="outline-3">
<h3 id="org07c6d8c">Custom functionality</h3>
<div class="outline-text-3" id="text-org07c6d8c">
</div>
<div id="outline-container-org5ded1d0" class="outline-4">
<h4 id="org5ded1d0">Words diff</h4>
<div class="outline-text-4" id="text-org5ded1d0">
<p>
Will get the number of words that's been changed. This is useful if
you use a service like ex. Crowdin for translations, where they charge
for number of words translated.
</p>
<div class="org-src-container">
<pre class="src src-shell">#!/bin/sh
set -euo pipefail

function usage {
  cat &lt;&lt; EOT

  Usage: git words-diff [options] [&lt;commit&gt;] [--] [&lt;path&gt;...]

  Options:

    -h, --help     output usage information

EOT
}

function git_words_added {
    git diff --word-diff=porcelain "$@" | grep -e "^+[^+]" | wc -w | xargs
}

function git_words_removed {
    git diff --word-diff=porcelain "$@" | grep -e "^-[^-]" | wc -w | xargs
}

function git_words_diff {
    echo $(($(git_words_added "$@") - $(git_words_removed "$@")))
}

while test $# -ne 0; do
  arg=$1; shift
  case $arg in
    -h|--help)
      usage
      exit 0
      ;;
    *)
      echo "Words added:   $(git_words_added $arg $@)"
      echo "Words removed: $(git_words_removed $arg $@)"
      echo "Sum:           $(git_words_diff $arg $@)"
      break;
      ;;
  esac
done
</pre>
</div>
</div>
</div>

<div id="outline-container-org36f94ed" class="outline-4">
<h4 id="org36f94ed">Who am I</h4>
<div class="outline-text-4" id="text-org36f94ed">
<p>
Run <code>git whoami</code> to see what's your user local to the repository you're in.
</p>
<div class="org-src-container">
<pre class="src src-shell">#!/bin/sh

# git-whoami
# Author: Peter Eisentraut &lt;peter@eisentraut.org&gt;
# Created: 2011-10-27
# License: WTFPL; see http://sam.zoy.org/wtfpl/

# exact logic in ident.c in git source tree

set -e

get_email() {
	git config user.email || ( [ -n "$EMAIL" ] &amp;&amp; echo "$EMAIL" ) || echo "$(id -nu)@$(hostname --fqdn)"
}

get_name() {
	git config user.name || getent passwd $(id -un) | cut -d : -f 5 | cut -d , -f 1
}

: ${GIT_AUTHOR_NAME=$(get_name)}
: ${GIT_COMMITTER_NAME=$(get_name)}
: ${GIT_AUTHOR_EMAIL=$(get_email)}
: ${GIT_COMMITTER_EMAIL=$(get_email)}

author="$GIT_AUTHOR_NAME &lt;$GIT_AUTHOR_EMAIL&gt;"
commit="$GIT_COMMITTER_NAME &lt;$GIT_COMMITTER_EMAIL&gt;"

if [ "$author" = "$commit" ]; then
	echo "$author"
else
	echo "Author: $author"
	echo "Commit: $commit"
fi
</pre>
</div>
</div>
</div>
</div>
