src/git.org
** Alias
#+name: alias
| amm          | commit -v --amend --no-edit                                                                                                 |
| appraise     | !git-appraise                                                                                                               |
| authors      | shortlog -sn                                                                                                                |
| br           | branch                                                                                                                      |
| bra          | branch -a                                                                                                                   |
| cb           | checkout -b                                                                                                                 |
| ci           | commit -v                                                                                                                   |
| cl           | clone --recursive                                                                                                           |
| clone        | clone --recursive                                                                                                           |
| co           | checkout                                                                                                                    |
| cp           | !git rev-parse HEAD ¦ tr -d "\\r" ¦ pbcopy                                                                                  |
| create-graph | commit-graph write --reachable                                                                                              |
| ctags        | !.git/hooks/ctags                                                                                                           |
| d            | diff --word-diff                                                                                                            |
| f            | !git-fresh                                                                                                                  |
| g            | grep --break --heading --line-number                                                                                        |
| ignored      | check-ignore -v                                                                                                             |
| lc           | show -s --format="%ct" HEAD                                                                                                 |
| lg           | log --graph --pretty=format:'%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr) %C(bold blue)<%an>%Creset' --abbrev-commit |
| ls           | ls-files                                                                                                                    |
| m            | merge                                                                                                                       |
| mt           | mergetool                                                                                                                   |
| mysprint     | log --since 1.week --author "$(git config user.name)"                                                                       |
| next         | !git add -A; git rebase --continue                                                                                          |
| p            | pull                                                                                                                        |
| perfect      | rebase -i @{u}                                                                                                              |
| pf           | push --force-with-lease                                                                                                     |
| pr           | pull-request                                                                                                                |
| rb           | rebase                                                                                                                      |
| rba          | rebase --abort                                                                                                              |
| rbc          | rebase --continue                                                                                                           |
| rbi          | rebase -i origin/master                                                                                                     |
| remotes      | remote -v                                                                                                                   |
| rm           | remove-commit                                                                                                               |
| rm-r         | push origin --delete                                                                                                        |
| root         | !pwd                                                                                                                        |
| s            | status -sb                                                                                                                  |
| sa           | submodule add                                                                                                               |
| sci          | dcommit -v                                                                                                                  |
| sf           | submodule foreach                                                                                                           |
| sh           | !git-sh                                                                                                                     |
| sha          | !fcs                                                                                                                        |
| sprint       | log --format "[%an] %s" --since 1.week                                                                                      |
| sr           | submodule remove                                                                                                            |
| st           | stash                                                                                                                       |
| sta          | stash apply                                                                                                                 |
| standup      | log --since "1 day ago" --oneline --author "$(git config user.name)"                                                        |
| std          | stash drop                                                                                                                  |
| stls         | stash list                                                                                                                  |
| stp          | stash pop                                                                                                                   |
| sts          | stash save                                                                                                                  |
| stu          | stash unstaged                                                                                                              |
| tags         | tag -l                                                                                                                      |
| today        | log --since 7am                                                                                                             |
| undo         | reset --soft HEAD^                                                                                                          |
| unstage      | reset HEAD --                                                                                                               |
| update       | pull --rebase                                                                                                               |


** Color
#+name: color
| ui     | true  |
| branch | auto  |
| diff   | auto  |
| status | auto  |


** Credential
#+name: credential
| helper | osxkeychain |


** Status
#+name: status
| showUntrackedFiles | all |


