docs/src/git.html

<div id="outline-container-orga623986" class="outline-3">
<h3 id="orga623986">Core</h3>
<div class="outline-text-3" id="text-orga623986">
<table id="org88e0df7" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">commitGraph</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgb5ae175" class="outline-3">
<h3 id="orgb5ae175">Alias</h3>
<div class="outline-text-3" id="text-orgb5ae175">
<table id="org42378c7" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">amm</td>
<td class="org-left">commit -v &#x2013;amend &#x2013;no-edit</td>
</tr>

<tr>
<td class="org-left">appraise</td>
<td class="org-left">!git-appraise</td>
</tr>

<tr>
<td class="org-left">authors</td>
<td class="org-left">shortlog -sn</td>
</tr>

<tr>
<td class="org-left">br</td>
<td class="org-left">branch</td>
</tr>

<tr>
<td class="org-left">bra</td>
<td class="org-left">branch -a</td>
</tr>

<tr>
<td class="org-left">cb</td>
<td class="org-left">checkout -b</td>
</tr>

<tr>
<td class="org-left">ci</td>
<td class="org-left">commit -v</td>
</tr>

<tr>
<td class="org-left">cl</td>
<td class="org-left">clone &#x2013;recursive</td>
</tr>

<tr>
<td class="org-left">clone</td>
<td class="org-left">clone &#x2013;recursive</td>
</tr>

<tr>
<td class="org-left">co</td>
<td class="org-left">checkout</td>
</tr>

<tr>
<td class="org-left">cp</td>
<td class="org-left">!git rev-parse HEAD ¦ tr -d "\\r" ¦ pbcopy</td>
</tr>

<tr>
<td class="org-left">create-graph</td>
<td class="org-left">commit-graph write &#x2013;reachable</td>
</tr>

<tr>
<td class="org-left">ctags</td>
<td class="org-left">!.git/hooks/ctags</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">diff &#x2013;word-diff</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">!git-fresh</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">grep &#x2013;break &#x2013;heading &#x2013;line-number</td>
</tr>

<tr>
<td class="org-left">ignored</td>
<td class="org-left">check-ignore -v</td>
</tr>

<tr>
<td class="org-left">lc</td>
<td class="org-left">show -s &#x2013;format="%ct" HEAD</td>
</tr>

<tr>
<td class="org-left">lg</td>
<td class="org-left">log &#x2013;graph &#x2013;pretty=format:'%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr) %C(bold blue)&lt;%an&gt;%Creset' &#x2013;abbrev-commit</td>
</tr>

<tr>
<td class="org-left">ls</td>
<td class="org-left">ls-files</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">merge</td>
</tr>

<tr>
<td class="org-left">mt</td>
<td class="org-left">mergetool</td>
</tr>

<tr>
<td class="org-left">mysprint</td>
<td class="org-left">log &#x2013;since 1.week &#x2013;author "$(git config user.name)"</td>
</tr>

<tr>
<td class="org-left">next</td>
<td class="org-left">!git add -A; git rebase &#x2013;continue</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">pull</td>
</tr>

<tr>
<td class="org-left">perfect</td>
<td class="org-left">rebase -i @{u}</td>
</tr>

<tr>
<td class="org-left">pf</td>
<td class="org-left">push &#x2013;force-with-lease</td>
</tr>

<tr>
<td class="org-left">pr</td>
<td class="org-left">pull-request</td>
</tr>

<tr>
<td class="org-left">rb</td>
<td class="org-left">rebase</td>
</tr>

<tr>
<td class="org-left">rba</td>
<td class="org-left">rebase &#x2013;abort</td>
</tr>

<tr>
<td class="org-left">rbc</td>
<td class="org-left">rebase &#x2013;continue</td>
</tr>

<tr>
<td class="org-left">rbi</td>
<td class="org-left">rebase -i origin/master</td>
</tr>

<tr>
<td class="org-left">remotes</td>
<td class="org-left">remote -v</td>
</tr>

<tr>
<td class="org-left">rm</td>
<td class="org-left">remove-commit</td>
</tr>

<tr>
<td class="org-left">rm-r</td>
<td class="org-left">push origin &#x2013;delete</td>
</tr>

<tr>
<td class="org-left">root</td>
<td class="org-left">!pwd</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">status -sb</td>
</tr>

<tr>
<td class="org-left">sa</td>
<td class="org-left">submodule add</td>
</tr>

<tr>
<td class="org-left">sci</td>
<td class="org-left">dcommit -v</td>
</tr>

<tr>
<td class="org-left">sf</td>
<td class="org-left">submodule foreach</td>
</tr>

<tr>
<td class="org-left">sh</td>
<td class="org-left">!git-sh</td>
</tr>

<tr>
<td class="org-left">sha</td>
<td class="org-left">!fcs</td>
</tr>

<tr>
<td class="org-left">sprint</td>
<td class="org-left">log &#x2013;format "[%an] %s" &#x2013;since 1.week</td>
</tr>

<tr>
<td class="org-left">sr</td>
<td class="org-left">submodule remove</td>
</tr>

<tr>
<td class="org-left">st</td>
<td class="org-left">stash</td>
</tr>

<tr>
<td class="org-left">sta</td>
<td class="org-left">stash apply</td>
</tr>

<tr>
<td class="org-left">standup</td>
<td class="org-left">log &#x2013;since "1 day ago" &#x2013;oneline &#x2013;author "$(git config user.name)"</td>
</tr>

<tr>
<td class="org-left">std</td>
<td class="org-left">stash drop</td>
</tr>

<tr>
<td class="org-left">stls</td>
<td class="org-left">stash list</td>
</tr>

<tr>
<td class="org-left">stp</td>
<td class="org-left">stash pop</td>
</tr>

<tr>
<td class="org-left">sts</td>
<td class="org-left">stash save</td>
</tr>

<tr>
<td class="org-left">stu</td>
<td class="org-left">stash unstaged</td>
</tr>

<tr>
<td class="org-left">tags</td>
<td class="org-left">tag -l</td>
</tr>

<tr>
<td class="org-left">today</td>
<td class="org-left">log &#x2013;since 7am</td>
</tr>

<tr>
<td class="org-left">undo</td>
<td class="org-left">reset &#x2013;soft HEAD^</td>
</tr>

<tr>
<td class="org-left">unstage</td>
<td class="org-left">reset HEAD --</td>
</tr>

<tr>
<td class="org-left">update</td>
<td class="org-left">pull &#x2013;rebase</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgeb5132d" class="outline-3">
<h3 id="orgeb5132d">Color</h3>
<div class="outline-text-3" id="text-orgeb5132d">
<table id="org592362d" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ui</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">branch</td>
<td class="org-left">auto</td>
</tr>

<tr>
<td class="org-left">diff</td>
<td class="org-left">auto</td>
</tr>

<tr>
<td class="org-left">status</td>
<td class="org-left">auto</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org5157c00" class="outline-3">
<h3 id="org5157c00">Credential</h3>
<div class="outline-text-3" id="text-org5157c00">
<table id="org523ba60" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">helper</td>
<td class="org-left">osxkeychain</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orga144f4e" class="outline-3">
<h3 id="orga144f4e">Status</h3>
<div class="outline-text-3" id="text-orga144f4e">
<table id="org550fd96" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">showUntrackedFiles</td>
<td class="org-left">all</td>
</tr>
</tbody>
</table>
</div>
</div>
