src/git.org
** Diff
#+name: diff
| mnemonicprefix | true      |
| algorithm      | histogram |

#+name: diff-clojure
| xfuncname | (^\\(.* ¦ \\s*\\(defn.*) |

#+name: diff-rust
| xfuncname | '^[ \t]*(pub¦)[ \t]*((fn¦struct¦enum¦impl¦trait¦mod)[^;]*)$' |


** Push
#+name: push
| default    | current |
| followTags | true    |


** Pull
#+name: pull
| rebase | true  |


** Commit
#+name: commit
| gpgSign | true |


** Fetch
#+name: fetch
| writeCommitGraph | true |


** GC
#+name: gc
| auto             |    1 |
| writeCommitGraph | true |


** Branch
#+name: branch
| autosetuprebase | always |


** Grep
#+name: grep
| extendRegexp | true |
| lineNumber   | true |


** Filters
#+name: filter-media
| clean    | git media clean %f  |
| smudge   | git media smudge %f |
| required | true                |

#+name: filter-lfs
| clean    | git-lfs clean -- %f    |
| smudge   | git-lfs smudge -- %f   |
| required | true                   |
| process  | git-lfs filter-process |


** Magit
#+name: magit
| hideCampaign | true |


** Apply
#+name: apply
| whitespace | nowarn |


** Merge
#+name: merge
| conflictstyle | diff3 |


** Transfer
We validate objects and their connection to commits before
transferring.
#+name: transfer
| fsckObjects | true |

** Include
We use a separate file for configurations that should not be pushed to
a remote. Could be for security purposes.
#+name: include
| path | ~/.gitconfig.local |


** Conversion to code                                                 :noexport:

#+name: key-val
#+begin_src emacs-lisp :var vals=alias
(replace-regexp-in-string "¦" "|" (message "%s" (mapconcat 'identity (mapcar (lambda (m) (format "%s = %s" (car m) (car (cdr m)))) vals) "\n")))
#+end_src

#+begin_src ini :tangle ~/.gitconfig :noweb yes :tangle-mode (identity #o444)
;; <<license>>

[core]
  <<key-val(core)>>

[alias]
  <<key-val(alias)>>

[color]
  <<key-val(color)>>

[status]
  <<key-val(status)>>

[credential]
  <<key-val(credential)>>

[merge]
  <<key-val(merge)>>

[diff]
  <<key-val(diff)>>

[diff "clojure"]
<<key-val(diff-clojure)>>

[diff "rust"]
<<key-val(diff-rust)>>

[push]
  <<key-val(push)>>

[pull]
  <<key-val(push)>>

[commit]
  <<key-val(commit)>>

[fetch]
  <<key-val(fetch)>>

[gc]
  <<key-val(gc)>>

[branch]
  <<key-val(branch)>>

[grep]
<<key-val(grep)>>

[filter "media"]
<<key-val(filter-media)>>

[filter "lfs"]
<<key-val(filter-lfs)>>

[magit]
<<key-val(magit)>>

[transfer]
<<key-val(transfer)>>

[include]
<<key-val(include)>>
#+end_src
