docs/src/git.html


<div id="outline-container-org4a21749" class="outline-3">
<h3 id="org4a21749">Diff</h3>
<div class="outline-text-3" id="text-org4a21749">
<table id="org5b92ea4" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">mnemonicprefix</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">algorithm</td>
<td class="org-left">histogram</td>
</tr>
</tbody>
</table>

<table id="org5b16c32" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">xfuncname</td>
<td class="org-left">(^\\(.* ¦ \\s*\\(defn.*)</td>
</tr>
</tbody>
</table>

<table id="org87fe198" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">xfuncname</td>
<td class="org-left">'^[ \t]*(pub¦)[ \t]*((fn¦struct¦enum¦impl¦trait¦mod)[^;]*)$'</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3080f5e" class="outline-3">
<h3 id="org3080f5e">Push</h3>
<div class="outline-text-3" id="text-org3080f5e">
<table id="org64676f4" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">default</td>
<td class="org-left">current</td>
</tr>

<tr>
<td class="org-left">followTags</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgcf81e62" class="outline-3">
<h3 id="orgcf81e62">Pull</h3>
<div class="outline-text-3" id="text-orgcf81e62">
<table id="orgd8ee321" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">rebase</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org8991ef4" class="outline-3">
<h3 id="org8991ef4">Commit</h3>
<div class="outline-text-3" id="text-org8991ef4">
<table id="orgc18a051" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">gpgSign</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3bfde0b" class="outline-3">
<h3 id="org3bfde0b">Fetch</h3>
<div class="outline-text-3" id="text-org3bfde0b">
<table id="org7049c97" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">writeCommitGraph</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org966ceb8" class="outline-3">
<h3 id="org966ceb8">GC</h3>
<div class="outline-text-3" id="text-org966ceb8">
<table id="orgedc2dc7" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">auto</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">writeCommitGraph</td>
<td class="org-right">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orga68ece5" class="outline-3">
<h3 id="orga68ece5">Branch</h3>
<div class="outline-text-3" id="text-orga68ece5">
<table id="org0d5ef62" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">autosetuprebase</td>
<td class="org-left">always</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orge5004e7" class="outline-3">
<h3 id="orge5004e7">Grep</h3>
<div class="outline-text-3" id="text-orge5004e7">
<table id="org98e6931" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">extendRegexp</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">lineNumber</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orga88a921" class="outline-3">
<h3 id="orga88a921">Filters</h3>
<div class="outline-text-3" id="text-orga88a921">
<table id="org1fcfc28" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">clean</td>
<td class="org-left">git media clean %f</td>
</tr>

<tr>
<td class="org-left">smudge</td>
<td class="org-left">git media smudge %f</td>
</tr>

<tr>
<td class="org-left">required</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>

<table id="orga3f0ffd" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">clean</td>
<td class="org-left">git-lfs clean &#x2013; %f</td>
</tr>

<tr>
<td class="org-left">smudge</td>
<td class="org-left">git-lfs smudge &#x2013; %f</td>
</tr>

<tr>
<td class="org-left">required</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">process</td>
<td class="org-left">git-lfs filter-process</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org28d36b4" class="outline-3">
<h3 id="org28d36b4">Magit</h3>
<div class="outline-text-3" id="text-org28d36b4">
<table id="org5bebb8b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">hideCampaign</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org714fa25" class="outline-3">
<h3 id="org714fa25">Apply</h3>
<div class="outline-text-3" id="text-org714fa25">
<table id="org9b1a464" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">whitespace</td>
<td class="org-left">nowarn</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgc3dcc3a" class="outline-3">
<h3 id="orgc3dcc3a">Merge</h3>
<div class="outline-text-3" id="text-orgc3dcc3a">
<table id="org4140415" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">conflictstyle</td>
<td class="org-left">diff3</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org1fe9403" class="outline-3">
<h3 id="org1fe9403">Transfer</h3>
<div class="outline-text-3" id="text-org1fe9403">
<p>
We validate objects and their connection to commits before
transferring.
</p>
<table id="org025fda0" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">fsckObjects</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9620b92" class="outline-3">
<h3 id="org9620b92">Include</h3>
<div class="outline-text-3" id="text-org9620b92">
<p>
We use a separate file for configurations that should not be pushed to
a remote. Could be for security purposes.
</p>
<table id="org654c420" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">path</td>
<td class="org-left">~/.gitconfig.local</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
